read_verilog -sv -formal input_path
chformal -lower
prep -top top_module
miter -equiv -make_outcmp top_module top_module miter_top
write_verilog output_path