read_verilog -sv -formal input_path
chformal -lower
prep -top top_module
flatten
memory -nordff
setundef -undriven -init -zero
delete -output
techmap
async2sync
dffunmap
abc -fast -g AND
write_aiger -zinit -map map_path output_path 
