read_verilog -sv -formal output/SE_leakymul_miter_exp/shortcut.sv
chformal -lower
prep -top top
flatten
memory -nordff
setundef -undriven -init -zero
delete -output
techmap
async2sync
dffunmap
abc -fast -g AND
write_aiger -zinit -map output/SE_leakymul_miter_exp/shortcut.map output/SE_leakymul_miter_exp/shortcut.aig 